export default {
  projections: {
    ПриходДенегE: {
      iD: {
        __caption__: 'ID'
      },
      дата: {
        __caption__: 'Дата'
      },
      расходПриход: {
        __caption__: 'Расход/приход'
      },
      тип: {
        __caption__: 'Тип'
      },
      сумма: {
        __caption__: 'Сумма'
      },
      финансисты: {
        __caption__: 'Финансисты',
        фИО: {
          __caption__: 'ФИО финансиста'
        }
      },
      клиенты: {
        __caption__: 'Клиенты',
        фИО: {
          __caption__: 'ФИО клиента'
        }
      },
      переченьУслуг: {
        __caption__: 'Перечень услуг',
        услуги: {
          __caption__: 'Услуги',
          наименование: {
            __caption__: 'Наименование'
          },
          стоимость: {
            __caption__: 'Стоимость'
          }
        },
        количество: {
          __caption__: 'Количество'
        }
      },
      переченьТоваров: {
        __caption__: 'Перечень товаров',
        товары: {
          __caption__: 'Товары',
          наименование: {
            __caption__: 'Наименование'
          },
          стоимость: {
            __caption__: 'Стоимость'
          }
        },
        количество: {
          __caption__: 'Количество'
        }
      }
    },
    ПриходДенегL: {
      iD: {
        __caption__: 'ID'
      },
      дата: {
        __caption__: 'Дата'
      },
      расходПриход: {
        __caption__: 'Расход/приход'
      },
      тип: {
        __caption__: 'Тип'
      },
      сумма: {
        __caption__: 'Сумма'
      },
      финансисты: {
        __caption__: 'ФИО финансиста',
        фИО: {
          __caption__: 'ФИО финансиста'
        }
      },
      клиенты: {
        __caption__: 'ФИО клиента',
        фИО: {
          __caption__: 'ФИО клиента'
        }
      }
    }
  },
  validations: {
    iD: {
      __caption__: 'ID'
    },
    дата: {
      __caption__: 'Дата'
    },
    расходПриход: {
      __caption__: 'Расход/приход'
    },
    сумма: {
      __caption__: 'Сумма'
    },
    тип: {
      __caption__: 'Тип'
    },
    клиенты: {
      __caption__: 'Клиенты'
    },
    финансисты: {
      __caption__: 'Финансисты'
    },
    переченьУслуг: {
      __caption__: 'Перечень услуг'
    },
    переченьТоваров: {
      __caption__: 'Перечень товаров'
    }
  }
};
